ibuttonlink/msp430fr5962/msp430fr5962.svd
        <register>
          <name>ADC12IV</name>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <description>ADC12_B Interrupt Vector</description>
          <fields>
            <field>
              <name>ADC12IV</name>
              <description>[15:0] interrupt vector value</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>Interrupt Source: No interrupt pending, Interrupt Flag: None</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12OVIFG</name>
                  <value>0x2</value>
                  <description>Interrupt Source: ADC12MEMx overflow, Interrupt Flag: ADC12OVIFG, Interrupt Priority: Highest</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12TOVIFG</name>
                  <value>0x4</value>
                  <description>Interrupt Source: Conversion time overflow, Interrupt Flag: ADC12TOVIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12HIIFG</name>
                  <value>0x6</value>
                  <description>Interrupt Source: ADC12 window high interrupt flag, Interrupt Flag: ADC12HIIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12LOIFG</name>
                  <value>0x8</value>
                  <description>Interrupt Source: ADC12 window low interrupt flag, Interrupt Flag: ADC12LOIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INIFG</name>
                  <value>0xA</value>
                  <description>Interrupt Source: ADC12 in-window interrupt flag, Interrupt Flag: ADC12INIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG0</name>
                  <value>0xC</value>
                  <description>Interrupt Source: ADC12MEM0 interrupt flag, Interrupt Flag: ADC12IFG0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG1</name>
                  <value>0xE</value>
                  <description>Interrupt Source: ADC12MEM1 interrupt flag, Interrupt Flag: ADC12IFG1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG2</name>
                  <value>0x10</value>
                  <description>Interrupt Source: ADC12MEM2 interrupt flag, Interrupt Flag: ADC12IFG2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG3</name>
                  <value>0x12</value>
                  <description>Interrupt Source: ADC12MEM3 interrupt flag, Interrupt Flag: ADC12IFG3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG4</name>
                  <value>0x14</value>
                  <description>Interrupt Source: ADC12MEM4 interrupt flag, Interrupt Flag: ADC12IFG4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG5</name>
                  <value>0x16</value>
                  <description>Interrupt Source: ADC12MEM5 interrupt flag, Interrupt Flag: ADC12IFG5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG6</name>
                  <value>0x18</value>
                  <description>Interrupt Source: ADC12MEM6 interrupt flag, Interrupt Flag: ADC12IFG6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG7</name>
                  <value>0x1A</value>
                  <description>Interrupt Source: ADC12MEM7 interrupt flag, Interrupt Flag: ADC12IFG7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG8</name>
                  <value>0x1C</value>
                  <description>Interrupt Source: ADC12MEM8 interrupt flag, Interrupt Flag: ADC12IFG8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG9</name>
                  <value>0x1E</value>
                  <description>Interrupt Source: ADC12MEM9 interrupt flag, Interrupt Flag: ADC12IFG9</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG10</name>
                  <value>0x20</value>
                  <description>Interrupt Source: ADC12MEM10 interrupt flag, Interrupt Flag: ADC12IFG10</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG11</name>
                  <value>0x22</value>
                  <description>Interrupt Source: ADC12MEM11 interrupt flag, Interrupt Flag: ADC12IFG11</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG12</name>
                  <value>0x24</value>
                  <description>Interrupt Source: ADC12MEM12 interrupt flag, Interrupt Flag: ADC12IFG12</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG13</name>
                  <value>0x26</value>
                  <description>Interrupt Source: ADC12MEM13 interrupt flag, Interrupt Flag: ADC12IFG13</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG14</name>
                  <value>0x28</value>
                  <description>Interrupt Source: ADC12MEM14 interrupt flag, Interrupt Flag: ADC12IFG14</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG15</name>
                  <value>0x2A</value>
                  <description>Interrupt Source: ADC12MEM15 interrupt flag, Interrupt Flag: ADC12IFG15</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG16</name>
                  <value>0x2C</value>
                  <description>Interrupt Source: ADC12MEM16 interrupt flag, Interrupt Flag: ADC12IFG16</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG17</name>
                  <value>0x2E</value>
                  <description>Interrupt Source: ADC12MEM17 interrupt flag, Interrupt Flag: ADC12IFG17</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG18</name>
                  <value>0x30</value>
                  <description>Interrupt Source: ADC12MEM18 interrupt flag, Interrupt Flag: ADC12IFG18</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG19</name>
                  <value>0x32</value>
                  <description>Interrupt Source: ADC12MEM19 interrupt flag, Interrupt Flag: ADC12IFG19</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG20</name>
                  <value>0x34</value>
                  <description>Interrupt Source: ADC12MEM20 interrupt flag, Interrupt Flag: ADC12IFG20</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG21</name>
                  <value>0x36</value>
                  <description>Interrupt Source: ADC12MEM21 interrupt flag, Interrupt Flag: ADC12IFG21</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG22</name>
                  <value>0x38</value>
                  <description>Interrupt Source: ADC12MEM22 interrupt flag, Interrupt Flag: ADC12IFG22</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG23</name>
                  <value>0x3A</value>
                  <description>Interrupt Source: ADC12MEM23 interrupt flag, Interrupt Flag: ADC12IFG23</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG24</name>
                  <value>0x3C</value>
                  <description>Interrupt Source: ADC12MEM24 interrupt flag, Interrupt Flag: ADC12IFG24</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG25</name>
                  <value>0x3E</value>
                  <description>Interrupt Source: ADC12MEM25 interrupt flag, Interrupt Flag: ADC12IFG25</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG26</name>
                  <value>0x40</value>
                  <description>Interrupt Source: ADC12MEM26 interrupt flag, Interrupt Flag: ADC12IFG26</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG27</name>
                  <value>0x42</value>
                  <description>Interrupt Source: ADC12MEM27 interrupt flag, Interrupt Flag: ADC12IFG27</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG28</name>
                  <value>0x44</value>
                  <description>Interrupt Source: ADC12MEM28 interrupt flag, Interrupt Flag: ADC12IFG28</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG29</name>
                  <value>0x46</value>
                  <description>Interrupt Source: ADC12MEM29 interrupt flag, Interrupt Flag: ADC12IFG29</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG30</name>
                  <value>0x48</value>
                  <description>Interrupt Source: ADC12MEM30 interrupt flag, Interrupt Flag: ADC12IFG30</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12IFG31</name>
                  <value>0x4A</value>
                  <description>Interrupt Source: ADC12MEM31 interrupt flag, Interrupt Flag: ADC12IFG31</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12RDYIFG</name>
                  <value>0x4C</value>
                  <description>Interrupt Source: ADC12RDYIFG interrupt flag, Interrupt Flag: ADC12RDYIFG</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
