ibuttonlink/msp430fr5962/msp430fr5962.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AES256</name>
      <baseAddress>0x09C0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>AESACTL0</name>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <description>AES Accelerator Control Register 0</description>
          <fields>
            <field>
              <name>AESOP</name>
              <description>[1:0] AES operation</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AESOP_0</name>
                  <value>0x0</value>
                  <description>Encryption</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AESOP_1</name>
                  <value>0x1</value>
                  <description>Decryption. The provided key is the same key used for encryption</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AESOP_2</name>
                  <value>0x2</value>
                  <description>Generate first round key required for decryption</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AESOP_3</name>
                  <value>0x3</value>
                  <description>Decryption. The provided key is the first round key required for decryption</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESKL</name>
              <description>[3:2] AES key length</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>128</name>
                  <value>0x0</value>
                  <description>AES128. The key size is 128 bit</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>192</name>
                  <value>0x1</value>
                  <description>AES192. The key size is 192 bit.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <value>0x2</value>
                  <description>AES256. The key size is 256 bit</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESCM</name>
              <description>[6:5] AES cipher mode select</description>
              <bitWidth>2</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECB</name>
                  <value>0x0</value>
                  <description>ECB</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBC</name>
                  <value>0x1</value>
                  <description>CBC</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFB</name>
                  <value>0x2</value>
                  <description>OFB</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CFB</name>
                  <value>0x3</value>
                  <description>CFB</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESSWRST</name>
              <description>[7:7] AES software reset</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AESSWRST_0</name>
                  <value>0x0</value>
                  <description>No reset</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <value>0x1</value>
                  <description>Reset AES accelerator module</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESRDYIFG</name>
              <description>[8:8] AES ready interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AESRDYIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AESRDYIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESERRFG</name>
              <description>[11:11] AES error flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AESERRFG_0</name>
                  <value>0x0</value>
                  <description>No error</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AESERRFG_1</name>
                  <value>0x1</value>
                  <description>Error occurred</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESRDYIE</name>
              <description>[12:12] AES ready interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Interrupt disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Interrupt enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESCMEN</name>
              <description>[15:15] AES cipher mode enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>No DMA triggers are generated</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>DMA ciphermode support operation is enabled and the corresponding DMA triggers are generated</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AESACTL1</name>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <description>AES Accelerator Control Register 1</description>
          <fields>
            <field>
              <name>AESBLKCNT</name>
              <description>[7:0] Cipher Block Counter</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AESASTAT</name>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <description>AES Accelerator Status Register</description>
          <fields>
            <field>
              <name>AESBUSY</name>
              <description>[0:0] AES accelerator module busy</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <value>0x0</value>
                  <description>Not busy</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <value>0x1</value>
                  <description>Busy</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESKEYWR</name>
              <description>[1:1] All 16 bytes written to AESAKEY</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AESKEYWR_0</name>
                  <value>0x0</value>
                  <description>Not all bytes written</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AESKEYWR_1</name>
                  <value>0x1</value>
                  <description>All bytes written</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESDINWR</name>
              <description>[2:2] All 16 bytes written to AESADIN, AESAXDIN or AESAXIN</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AESDINWR_0</name>
                  <value>0x0</value>
                  <description>Not all bytes written</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AESDINWR_1</name>
                  <value>0x1</value>
                  <description>All bytes written</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESDOUTRD</name>
              <description>[3:3] All 16 bytes read from AESADOUT</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AESDOUTRD_0</name>
                  <value>0x0</value>
                  <description>Not all bytes read</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AESDOUTRD_1</name>
                  <value>0x1</value>
                  <description>All bytes read</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESKEYCNT</name>
              <description>[7:4] Bytes written via AESAKEY for AESKL=00, half-words written via AESAKEY</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>AESDINCNT</name>
              <description>[11:8] Bytes written via AESADIN, AESAXDIN or AESAXIN</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>AESDOUTCNT</name>
              <description>[15:12] Bytes read via AESADOUT</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AESAKEY</name>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <description>AES Accelerator Key Register</description>
          <fields>
            <field>
              <name>AESKEY0</name>
              <description>[7:0] AES key byte n when AESAKEY is written as half-word</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>AESKEY1</name>
              <description>[15:8] AES key byte n+1 when AESAKEY is written as half-word</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AESADIN</name>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <description>AES Accelerator Data In Register</description>
          <fields>
            <field>
              <name>AESDIN0</name>
              <description>[7:0] AES data in byte n when AESADIN is written as half-word</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>AESDIN1</name>
              <description>[15:8] AES data in byte n+1 when AESADIN is written as half-word</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AESADOUT</name>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <description>AES Accelerator Data Out Register</description>
          <fields>
            <field>
              <name>AESDOUT0</name>
              <description>[7:0] AES data out byte n when AESADOUT is read as half-word</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>AESDOUT1</name>
              <description>[15:8] AES data out byte n+1 when AESADOUT is read as half-word</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AESAXDIN</name>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <description>AES Accelerator XORed Data In Register</description>
          <fields>
            <field>
              <name>AESXDIN0</name>
              <description>[7:0] AES data in byte n when AESAXDIN is written as half-word</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>AESXDIN1</name>
              <description>[15:8] AES data in byte n+1 when AESAXDIN is written as half-word</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AESAXIN</name>
          <addressOffset>0xE</addressOffset>
          <size>16</size>
          <description>AES Accelerator XORed Data In Register</description>
          <fields>
            <field>
              <name>AESXIN0</name>
              <description>[7:0] AES data in byte n when AESAXIN is written as half-word</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>AESXIN1</name>
              <description>[15:8] AES data in byte n+1 when AESAXIN is written as half-word</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
