ibuttonlink/msp430fr5962/msp430fr5962.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP_E</name>
      <baseAddress>0x08C0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CECTL0</name>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <description>Comparator Control Register 0</description>
          <fields>
            <field>
              <name>CEIPSEL</name>
              <description>[3:0] Channel input selected for the V+ terminal</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEIPSEL_0</name>
                  <value>0x0</value>
                  <description>Channel 0 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_1</name>
                  <value>0x1</value>
                  <description>Channel 1 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_2</name>
                  <value>0x2</value>
                  <description>Channel 2 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_3</name>
                  <value>0x3</value>
                  <description>Channel 3 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_4</name>
                  <value>0x4</value>
                  <description>Channel 4 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_5</name>
                  <value>0x5</value>
                  <description>Channel 5 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_6</name>
                  <value>0x6</value>
                  <description>Channel 6 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_7</name>
                  <value>0x7</value>
                  <description>Channel 7 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_8</name>
                  <value>0x8</value>
                  <description>Channel 8 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_9</name>
                  <value>0x9</value>
                  <description>Channel 9 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_10</name>
                  <value>0xA</value>
                  <description>Channel 10 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_11</name>
                  <value>0xB</value>
                  <description>Channel 11 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_12</name>
                  <value>0xC</value>
                  <description>Channel 12 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_13</name>
                  <value>0xD</value>
                  <description>Channel 13 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_14</name>
                  <value>0xE</value>
                  <description>Channel 14 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_15</name>
                  <value>0xF</value>
                  <description>Channel 15 selected</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEIPEN</name>
              <description>[7:7] Channel input enable for the V+ terminal</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Selected analog input channel for V+ terminal is disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Selected analog input channel for V+ terminal is enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEIMSEL</name>
              <description>[11:8] Channel input selected for the - terminal</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEIMSEL_0</name>
                  <value>0x0</value>
                  <description>Channel 0 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_1</name>
                  <value>0x1</value>
                  <description>Channel 1 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_2</name>
                  <value>0x2</value>
                  <description>Channel 2 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_3</name>
                  <value>0x3</value>
                  <description>Channel 3 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_4</name>
                  <value>0x4</value>
                  <description>Channel 4 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_5</name>
                  <value>0x5</value>
                  <description>Channel 5 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_6</name>
                  <value>0x6</value>
                  <description>Channel 6 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_7</name>
                  <value>0x7</value>
                  <description>Channel 7 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_8</name>
                  <value>0x8</value>
                  <description>Channel 8 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_9</name>
                  <value>0x9</value>
                  <description>Channel 9 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_10</name>
                  <value>0xA</value>
                  <description>Channel 10 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_11</name>
                  <value>0xB</value>
                  <description>Channel 11 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_12</name>
                  <value>0xC</value>
                  <description>Channel 12 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_13</name>
                  <value>0xD</value>
                  <description>Channel 13 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_14</name>
                  <value>0xE</value>
                  <description>Channel 14 selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_15</name>
                  <value>0xF</value>
                  <description>Channel 15 selected</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEIMEN</name>
              <description>[15:15] Channel input enable for the - terminal</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Selected analog input channel for V- terminal is disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Selected analog input channel for V- terminal is enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CECTL1</name>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <description>Comparator Control Register 1</description>
          <fields>
            <field>
              <name>CEOUT</name>
              <description>[0:0] Comparator output value</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>CEOUTPOL</name>
              <description>[1:1] Comparator output polarity</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEOUTPOL_0</name>
                  <value>0x0</value>
                  <description>Noninverted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEOUTPOL_1</name>
                  <value>0x1</value>
                  <description>Inverted</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEF</name>
              <description>[2:2] Comparator output filter</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEF_0</name>
                  <value>0x0</value>
                  <description>Comparator output is not filtered</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEF_1</name>
                  <value>0x1</value>
                  <description>Comparator output is filtered</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEIES</name>
              <description>[3:3] Interrupt edge select for CEIIFG and CEIFG</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEIES_0</name>
                  <value>0x0</value>
                  <description>Rising edge for CEIFG, falling edge for CEIIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIES_1</name>
                  <value>0x1</value>
                  <description>Falling edge for CEIFG, rising edge for CEIIFG</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CESHORT</name>
              <description>[4:4] Input short</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CESHORT_0</name>
                  <value>0x0</value>
                  <description>Inputs not shorted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CESHORT_1</name>
                  <value>0x1</value>
                  <description>Inputs shorted</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEEX</name>
              <description>[5:5] Exchange</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>CEFDLY</name>
              <description>[7:6] Filter delay</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEFDLY_0</name>
                  <value>0x0</value>
                  <description>Typical filter delay of TBD (450) ns</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEFDLY_1</name>
                  <value>0x1</value>
                  <description>Typical filter delay of TBD (900) ns</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEFDLY_2</name>
                  <value>0x2</value>
                  <description>Typical filter delay of TBD (1800) ns</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEFDLY_3</name>
                  <value>0x3</value>
                  <description>Typical filter delay of TBD (3600) ns</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEPWRMD</name>
              <description>[9:8] Power Mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEPWRMD_0</name>
                  <value>0x0</value>
                  <description>High-speed mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEPWRMD_1</name>
                  <value>0x1</value>
                  <description>Normal mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEPWRMD_2</name>
                  <value>0x2</value>
                  <description>Ultra-low power mode</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEON</name>
              <description>[10:10] Comparator On</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <value>0x0</value>
                  <description>Off</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <value>0x1</value>
                  <description>On</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEMRVL</name>
              <description>[11:11] This bit is valid of CEMRVS is set to 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VREF0</name>
                  <value>0x0</value>
                  <description>VREF0 is selected if CERS = 00, 01, or 10</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREF1</name>
                  <value>0x1</value>
                  <description>VREF1 is selected if CERS = 00, 01, or 10</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEMRVS</name>
              <description>[12:12] This bit defines if the comparator output selects between VREF0 or VREF1 if CERS = 00, 01, or 10.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEMRVS_0</name>
                  <value>0x0</value>
                  <description>Comparator output state selects between VREF0 or VREF1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEMRVS_1</name>
                  <value>0x1</value>
                  <description>CEMRVL selects between VREF0 or VREF1</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CECTL2</name>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <description>Comparator Control Register 2</description>
          <fields>
            <field>
              <name>CEREF0</name>
              <description>[4:0] Reference resistor tap 0</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>CERSEL</name>
              <description>[5:5] Reference select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CERSEL_0</name>
                  <value>0x0</value>
                  <description>When CEEX = 0, VREF is applied to the V+ terminal; When CEEX = 1, VREF is applied to the V- terminal</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CERSEL_1</name>
                  <value>0x1</value>
                  <description>When CEEX = 0, VREF is applied to the V- terminal; When CEEX = 1, VREF is applied to the V+ terminal</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CERS</name>
              <description>[7:6] Reference source</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CERS_0</name>
                  <value>0x0</value>
                  <description>No current is drawn by the reference circuitry</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CERS_1</name>
                  <value>0x1</value>
                  <description>VCC applied to the resistor ladder</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CERS_2</name>
                  <value>0x2</value>
                  <description>Shared reference voltage applied to the resistor ladder</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CERS_3</name>
                  <value>0x3</value>
                  <description>Shared reference voltage supplied to V(CREF). Resistor ladder is off</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEREF1</name>
              <description>[12:8] Reference resistor tap 1</description>
              <bitWidth>5</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CEREFL</name>
              <description>[14:13] Reference voltage level</description>
              <bitWidth>2</bitWidth>
              <bitOffset>13</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <value>0x0</value>
                  <description>Reference amplifier is disabled. No reference voltage is requested</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1P2V</name>
                  <value>0x1</value>
                  <description>1.2 V is selected as shared reference voltage input</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2P0V</name>
                  <value>0x2</value>
                  <description>2.0 V is selected as shared reference voltage input</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2P5V</name>
                  <value>0x3</value>
                  <description>2.5 V is selected as shared reference voltage input</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEREFACC</name>
              <description>[15:15] Reference accuracy</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STATIC</name>
                  <value>0x0</value>
                  <description>Static mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCKED</name>
                  <value>0x1</value>
                  <description>Clocked (low power, low accuracy) mode</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
