ibuttonlink/msp430fr5962/msp430fr5962.svd
        <register>
          <name>CSCTL4</name>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <description>Clock System Control 4</description>
          <fields>
            <field>
              <name>LFXTOFF</name>
              <description>[0:0] LFXT off</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFXTOFF_0</name>
                  <value>0x0</value>
                  <description>LFXT is on if LFXT is selected via the port selection and LFXT is not in bypass mode of operation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXTOFF_1</name>
                  <value>0x1</value>
                  <description>LFXT is off if it is not used as a source for ACLK, MCLK, or SMCLK</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMCLKOFF</name>
              <description>[1:1] SMCLK off</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SMCLKOFF_0</name>
                  <value>0x0</value>
                  <description>SMCLK on</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMCLKOFF_1</name>
                  <value>0x1</value>
                  <description>SMCLK off</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VLOOFF</name>
              <description>[3:3] VLO off</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VLOOFF_0</name>
                  <value>0x0</value>
                  <description>VLO is on</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLOOFF_1</name>
                  <value>0x1</value>
                  <description>VLO is off if it is not used as a source for ACLK, MCLK, or SMCLK or if not used as a source for the RTC in LPM3.5</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LFXTBYPASS</name>
              <description>[4:4] LFXT bypass select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFXTBYPASS_0</name>
                  <value>0x0</value>
                  <description>LFXT sourced from external crystal</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXTBYPASS_1</name>
                  <value>0x1</value>
                  <description>LFXT sourced from external clock signal</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LFXTDRIVE</name>
              <description>[7:6] LFXT oscillator current</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFXTDRIVE_0</name>
                  <value>0x0</value>
                  <description>Lowest drive strength and current consumption LFXT oscillator</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXTDRIVE_1</name>
                  <value>0x1</value>
                  <description>Increased drive strength LFXT oscillator</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXTDRIVE_2</name>
                  <value>0x2</value>
                  <description>Increased drive strength LFXT oscillator</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXTDRIVE_3</name>
                  <value>0x3</value>
                  <description>Maximum drive strength and maximum current consumption LFXT oscillator</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFXTOFF</name>
              <description>[8:8] Turns off the HFXT oscillator</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFXTOFF_0</name>
                  <value>0x0</value>
                  <description>HFXT is on if HFXT is selected via the port selection and HFXT is not in bypass mode of operation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXTOFF_1</name>
                  <value>0x1</value>
                  <description>HFXT is off if it is not used as a source for ACLK, MCLK, or SMCLK</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFFREQ</name>
              <description>[11:10] HFXT frequency selection</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFFREQ_0</name>
                  <value>0x0</value>
                  <description>0 to 4 MHz</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFFREQ_1</name>
                  <value>0x1</value>
                  <description>Greater than 4 MHz to 8 MHz</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFFREQ_2</name>
                  <value>0x2</value>
                  <description>Greater than 8 MHz to 16 MHz</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFFREQ_3</name>
                  <value>0x3</value>
                  <description>Greater than 16 MHz to 24 MHz</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFXTBYPASS</name>
              <description>[12:12] HFXT bypass select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFXTBYPASS_0</name>
                  <value>0x0</value>
                  <description>HFXT sourced from external crystal</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXTBYPASS_1</name>
                  <value>0x1</value>
                  <description>HFXT sourced from external clock signal</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFXTDRIVE</name>
              <description>[15:14] HFXT oscillator current</description>
              <bitWidth>2</bitWidth>
              <bitOffset>14</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFXTDRIVE_0</name>
                  <value>0x0</value>
                  <description>Lowest current consumption</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXTDRIVE_1</name>
                  <value>0x1</value>
                  <description>Increased drive strength HFXT oscillator</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXTDRIVE_2</name>
                  <value>0x2</value>
                  <description>Increased drive strength HFXT oscillator</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXTDRIVE_3</name>
                  <value>0x3</value>
                  <description>Maximum drive strength HFXT oscillator</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSCTL5</name>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <description>Clock System Control 5</description>
          <fields>
            <field>
              <name>LFXTOFFG</name>
              <description>[0:0] LFXT oscillator fault flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFXTOFFG_0</name>
                  <value>0x0</value>
                  <description>No fault condition occurred after the last reset</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXTOFFG_1</name>
                  <value>0x1</value>
                  <description>LFXT fault; an LFXT fault occurred after the last reset</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFXTOFFG</name>
              <description>[1:1] HFXT oscillator fault flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFXTOFFG_0</name>
                  <value>0x0</value>
                  <description>No fault condition occurred after the last reset</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXTOFFG_1</name>
                  <value>0x1</value>
                  <description>HFXT fault; an HFXT fault occurred after the last reset</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENSTFCNT1</name>
              <description>[6:6] Enable start counter for LFXT</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Startup fault counter disabled. Counter is cleared.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Startup fault counter enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENSTFCNT2</name>
              <description>[7:7] Enable start counter for HFXT</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Startup fault counter disabled. Counter is cleared.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Startup fault counter enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSCTL6</name>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <description>Clock System Control 6</description>
          <fields>
            <field>
              <name>ACLKREQEN</name>
              <description>[0:0] ACLK clock request enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>ACLK conditional requests are disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>ACLK conditional requests are enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCLKREQEN</name>
              <description>[1:1] MCLK clock request enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>MCLK conditional requests are disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>MCLK conditional requests are enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMCLKREQEN</name>
              <description>[2:2] SMCLK clock request enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>SMCLK conditional requests are disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>SMCLK conditional requests are enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODCLKREQEN</name>
              <description>[3:3] MODCLK clock request enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>MODCLK conditional requests are disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>MODCLK conditional requests are enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
