ibuttonlink/msp430fr5962/msp430fr5962.svd
        <register>
          <name>P1IFG</name>
          <addressOffset>0x1C</addressOffset>
          <size>8</size>
          <description>Port 1 Interrupt Flag</description>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>P0</name>
              <description>P0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P1</name>
              <description>P1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P2</name>
              <description>P2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P3</name>
              <description>P3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P4</name>
              <description>P4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5</name>
              <description>P5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6</name>
              <description>P6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P7</name>
              <description>P7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>P2</name>
      <baseAddress>0x0200</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>P2IV</name>
          <addressOffset>0x1E</addressOffset>
          <size>16</size>
          <description>Port 2 Interrupt Vector Register</description>
          <fields>
            <field>
              <name>P2IV</name>
              <description>[4:0] Port 2 interrupt vector value</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P2IFG0</name>
                  <value>0x2</value>
                  <description>Interrupt Source: Port 2.0 interrupt; Interrupt Flag: P2IFG0; Interrupt Priority: Highest</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P2IFG1</name>
                  <value>0x4</value>
                  <description>Interrupt Source: Port 2.1 interrupt; Interrupt Flag: P2IFG1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P2IFG2</name>
                  <value>0x6</value>
                  <description>Interrupt Source: Port 2.2 interrupt; Interrupt Flag: P2IFG2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P2IFG3</name>
                  <value>0x8</value>
                  <description>Interrupt Source: Port 2.3 interrupt; Interrupt Flag: P2IFG3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P2IFG4</name>
                  <value>0xA</value>
                  <description>Interrupt Source: Port 2.4 interrupt; Interrupt Flag: P2IFG4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P2IFG5</name>
                  <value>0xC</value>
                  <description>Interrupt Source: Port 2.5 interrupt; Interrupt Flag: P2IFG5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P2IFG6</name>
                  <value>0xE</value>
                  <description>Interrupt Source: Port 2.6 interrupt; Interrupt Flag: P2IFG6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P2IFG7</name>
                  <value>0x10</value>
                  <description>Interrupt Source: Port 2.7 interrupt; Interrupt Flag: P2IFG7; Interrupt Priority: Lowest</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P2IN</name>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <description>Port 2 Input</description>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>P0</name>
              <description>P0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P1</name>
              <description>P1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P2</name>
              <description>P2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P3</name>
              <description>P3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P4</name>
              <description>P4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5</name>
              <description>P5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6</name>
              <description>P6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P7</name>
              <description>P7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2OUT</name>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
          <description>Port 2 Output</description>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>P0</name>
              <description>P0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P1</name>
              <description>P1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P2</name>
              <description>P2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P3</name>
              <description>P3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P4</name>
              <description>P4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5</name>
              <description>P5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6</name>
              <description>P6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P7</name>
              <description>P7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2DIR</name>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
          <description>Port 2 Direction</description>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>P0</name>
              <description>P0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P1</name>
              <description>P1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P2</name>
              <description>P2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P3</name>
              <description>P3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P4</name>
              <description>P4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5</name>
              <description>P5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6</name>
              <description>P6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P7</name>
              <description>P7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2REN</name>
          <addressOffset>0x7</addressOffset>
          <size>8</size>
          <description>Port 2 Resistor Enable</description>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>P0</name>
              <description>P0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P1</name>
              <description>P1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P2</name>
              <description>P2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P3</name>
              <description>P3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P4</name>
              <description>P4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5</name>
              <description>P5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6</name>
              <description>P6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P7</name>
              <description>P7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2SEL0</name>
          <addressOffset>0xB</addressOffset>
          <size>8</size>
          <description>Port 2 Select 0</description>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>P0</name>
              <description>P0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P1</name>
              <description>P1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P2</name>
              <description>P2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P3</name>
              <description>P3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P4</name>
              <description>P4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5</name>
              <description>P5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6</name>
              <description>P6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P7</name>
              <description>P7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2SEL1</name>
          <addressOffset>0xD</addressOffset>
          <size>8</size>
          <description>Port 2 Select 1</description>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>P0</name>
              <description>P0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P1</name>
              <description>P1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P2</name>
              <description>P2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P3</name>
              <description>P3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P4</name>
              <description>P4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5</name>
              <description>P5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6</name>
              <description>P6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P7</name>
              <description>P7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2SELC</name>
          <addressOffset>0x17</addressOffset>
          <size>8</size>
          <description>Port 2 Complement Select</description>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>P0</name>
              <description>P0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P1</name>
              <description>P1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P2</name>
              <description>P2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P3</name>
              <description>P3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P4</name>
              <description>P4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5</name>
              <description>P5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6</name>
              <description>P6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P7</name>
              <description>P7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2IES</name>
          <addressOffset>0x19</addressOffset>
          <size>8</size>
          <description>Port 2 Interrupt Edge Select</description>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>P0</name>
              <description>P0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P1</name>
              <description>P1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P2</name>
              <description>P2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P3</name>
              <description>P3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P4</name>
              <description>P4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5</name>
              <description>P5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6</name>
              <description>P6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P7</name>
              <description>P7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
