ibuttonlink/msp430fr5962/msp430fr5962.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <baseAddress>0x0500</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DMACTL0</name>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <description>DMA Control 0</description>
          <fields>
            <field>
              <name>DMA0TSEL</name>
              <description>[4:0] DMA trigger select</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA0TRIG0</name>
                  <value>0x0</value>
                  <description>DMA0TRIG0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG1</name>
                  <value>0x1</value>
                  <description>DMA0TRIG1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG2</name>
                  <value>0x2</value>
                  <description>DMA0TRIG2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG3</name>
                  <value>0x3</value>
                  <description>DMA0TRIG3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG4</name>
                  <value>0x4</value>
                  <description>DMA0TRIG4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG5</name>
                  <value>0x5</value>
                  <description>DMA0TRIG5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG6</name>
                  <value>0x6</value>
                  <description>DMA0TRIG6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG7</name>
                  <value>0x7</value>
                  <description>DMA0TRIG7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG8</name>
                  <value>0x8</value>
                  <description>DMA0TRIG8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG9</name>
                  <value>0x9</value>
                  <description>DMA0TRIG9</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG10</name>
                  <value>0xA</value>
                  <description>DMA0TRIG10</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG11</name>
                  <value>0xB</value>
                  <description>DMA0TRIG11</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG12</name>
                  <value>0xC</value>
                  <description>DMA0TRIG12</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG13</name>
                  <value>0xD</value>
                  <description>DMA0TRIG13</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG14</name>
                  <value>0xE</value>
                  <description>DMA0TRIG14</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG15</name>
                  <value>0xF</value>
                  <description>DMA0TRIG15</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG16</name>
                  <value>0x10</value>
                  <description>DMA0TRIG16</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG17</name>
                  <value>0x11</value>
                  <description>DMA0TRIG17</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG18</name>
                  <value>0x12</value>
                  <description>DMA0TRIG18</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG19</name>
                  <value>0x13</value>
                  <description>DMA0TRIG19</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG20</name>
                  <value>0x14</value>
                  <description>DMA0TRIG20</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG21</name>
                  <value>0x15</value>
                  <description>DMA0TRIG21</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG22</name>
                  <value>0x16</value>
                  <description>DMA0TRIG22</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG23</name>
                  <value>0x17</value>
                  <description>DMA0TRIG23</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG24</name>
                  <value>0x18</value>
                  <description>DMA0TRIG24</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG25</name>
                  <value>0x19</value>
                  <description>DMA0TRIG25</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG26</name>
                  <value>0x1A</value>
                  <description>DMA0TRIG26</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG27</name>
                  <value>0x1B</value>
                  <description>DMA0TRIG27</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG28</name>
                  <value>0x1C</value>
                  <description>DMA0TRIG28</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG29</name>
                  <value>0x1D</value>
                  <description>DMA0TRIG29</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG30</name>
                  <value>0x1E</value>
                  <description>DMA0TRIG30</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TRIG31</name>
                  <value>0x1F</value>
                  <description>DMA0TRIG31</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA1TSEL</name>
              <description>[12:8] DMA trigger select</description>
              <bitWidth>5</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA1TRIG0</name>
                  <value>0x0</value>
                  <description>DMA1TRIG0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG1</name>
                  <value>0x1</value>
                  <description>DMA1TRIG1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG2</name>
                  <value>0x2</value>
                  <description>DMA1TRIG2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG3</name>
                  <value>0x3</value>
                  <description>DMA1TRIG3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG4</name>
                  <value>0x4</value>
                  <description>DMA1TRIG4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG5</name>
                  <value>0x5</value>
                  <description>DMA1TRIG5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG6</name>
                  <value>0x6</value>
                  <description>DMA1TRIG6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG7</name>
                  <value>0x7</value>
                  <description>DMA1TRIG7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG8</name>
                  <value>0x8</value>
                  <description>DMA1TRIG8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG9</name>
                  <value>0x9</value>
                  <description>DMA1TRIG9</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG10</name>
                  <value>0xA</value>
                  <description>DMA1TRIG10</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG11</name>
                  <value>0xB</value>
                  <description>DMA1TRIG11</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG12</name>
                  <value>0xC</value>
                  <description>DMA1TRIG12</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG13</name>
                  <value>0xD</value>
                  <description>DMA1TRIG13</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG14</name>
                  <value>0xE</value>
                  <description>DMA1TRIG14</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG15</name>
                  <value>0xF</value>
                  <description>DMA1TRIG15</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG16</name>
                  <value>0x10</value>
                  <description>DMA1TRIG16</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG17</name>
                  <value>0x11</value>
                  <description>DMA1TRIG17</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG18</name>
                  <value>0x12</value>
                  <description>DMA1TRIG18</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG19</name>
                  <value>0x13</value>
                  <description>DMA1TRIG19</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG20</name>
                  <value>0x14</value>
                  <description>DMA1TRIG20</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG21</name>
                  <value>0x15</value>
                  <description>DMA1TRIG21</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG22</name>
                  <value>0x16</value>
                  <description>DMA1TRIG22</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG23</name>
                  <value>0x17</value>
                  <description>DMA1TRIG23</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG24</name>
                  <value>0x18</value>
                  <description>DMA1TRIG24</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG25</name>
                  <value>0x19</value>
                  <description>DMA1TRIG25</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG26</name>
                  <value>0x1A</value>
                  <description>DMA1TRIG26</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG27</name>
                  <value>0x1B</value>
                  <description>DMA1TRIG27</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG28</name>
                  <value>0x1C</value>
                  <description>DMA1TRIG28</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG29</name>
                  <value>0x1D</value>
                  <description>DMA1TRIG29</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG30</name>
                  <value>0x1E</value>
                  <description>DMA1TRIG30</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TRIG31</name>
                  <value>0x1F</value>
                  <description>DMA1TRIG31</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
