ibuttonlink/msp430fr5962/msp430fr5962.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FRCTL_A</name>
      <baseAddress>0x0140</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>FRCTL0</name>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <description>FRAM Controller A Control Register 0</description>
          <fields>
            <field>
              <name>NWAITS</name>
              <description>[7:4] Wait state numbers</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NWAITS_0</name>
                  <value>0x0</value>
                  <description>FRAM wait states: 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_1</name>
                  <value>0x1</value>
                  <description>FRAM wait states: 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_2</name>
                  <value>0x2</value>
                  <description>FRAM wait states: 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_3</name>
                  <value>0x3</value>
                  <description>FRAM wait states: 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_4</name>
                  <value>0x4</value>
                  <description>FRAM wait states: 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_5</name>
                  <value>0x5</value>
                  <description>FRAM wait states: 5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_6</name>
                  <value>0x6</value>
                  <description>FRAM wait states: 6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_7</name>
                  <value>0x7</value>
                  <description>FRAM wait states: 7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_8</name>
                  <value>0x8</value>
                  <description>FRAM wait states: 8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_9</name>
                  <value>0x9</value>
                  <description>FRAM wait states: 9</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_10</name>
                  <value>0xA</value>
                  <description>FRAM wait states: 10</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_11</name>
                  <value>0xB</value>
                  <description>FRAM wait states: 11</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_12</name>
                  <value>0xC</value>
                  <description>FRAM wait states: 12</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_13</name>
                  <value>0xD</value>
                  <description>FRAM wait states: 13</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_14</name>
                  <value>0xE</value>
                  <description>FRAM wait states: 14</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_15</name>
                  <value>0xF</value>
                  <description>FRAM wait states: 15</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRCTLPW</name>
              <description>[15:8] FRCTLPW password</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>AUTO</name>
              <description>[3:3] Enable automatic Wait State Mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUTO_0</name>
                  <value>0x0</value>
                  <description>User Wait State Mode. The NWAITS[3:0] is used for the FRAM wait state.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO_1</name>
                  <value>0x1</value>
                  <description>Auto mode. The NWAITS[3:0] is ignored. Wait states are generated automatically by the internal FRAM controller state machine.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WPROT</name>
              <description>[0:0] Write Protection Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WPROT_0</name>
                  <value>0x0</value>
                  <description>Disable Write Protection. Write to FRAM memory is allowed.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WPROT_1</name>
                  <value>0x1</value>
                  <description>Enable Write Protection. Write to FRAM memory is not allowed. In case a write access is attempted, the WPIFG (Write Protection Flag) bit will be set.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GCCTL0</name>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <description>General Control Register 0</description>
          <fields>
            <field>
              <name>UBDRSTEN</name>
              <description>[7:7] Enable Power Up Clear (PUC) reset for the uncorrectable bit error detection flag (UBDIFG)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UBDRSTEN_0</name>
                  <value>0x0</value>
                  <description>PUC not initiated on uncorrectable bit error detection flag.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UBDRSTEN_1</name>
                  <value>0x1</value>
                  <description>PUC initiated on uncorrectable bit error detection flag. Generates vector in SYSRSTIV. Clear the UBDIE bit.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UBDIE</name>
              <description>[6:6] Enable NMI event for the uncorrectable bit error detection flag (UBDIFG)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UBDIE_0</name>
                  <value>0x0</value>
                  <description>Disable NMI for the uncorrectable bit error detection flag (UBDIFG).</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UBDIE_1</name>
                  <value>0x1</value>
                  <description>Enable NMI for the uncorrectable bit error detection flag (UBDIFG). Generates vector in SYSSNIV. Clear the UBDRSTEN bit.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBDIE</name>
              <description>[5:5] Enable NMI event for the correctable bit error detection flag (CBDIFG)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBDIE_0</name>
                  <value>0x0</value>
                  <description>Disable NMI for the correctable bit error detection flag (CBDIFG).</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBDIE_1</name>
                  <value>0x1</value>
                  <description>Disable NMI for the correctable bit error detection flag (CBDIFG). Generates vector in SYSSNIV.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WPIE</name>
              <description>[4:4] Enable NMI event for the Write Protection Detection flag (WPIFG)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WPIE_0</name>
                  <value>0x0</value>
                  <description>Disable NMI for the Write Protection Detection flag (WPIFG).</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WPIE_1</name>
                  <value>0x1</value>
                  <description>Enable NMI for the Write Protection Detection flag (WPIFG). Generates vector in SYSSNIV.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACCTEIE</name>
              <description>[3:3] Enable NMI event for the Access time error flag (ACCTEIFG)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCTEIE_0</name>
                  <value>0x0</value>
                  <description>Disable NMI for the Access time error flag (ACCTEIFG).</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCTEIE_1</name>
                  <value>0x1</value>
                  <description>Enable NMI for the Access time error flag (ACCTEIFG). Generates vector in SYSSNIV.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRPWR</name>
              <description>[2:2] FRAM Memory Power Control Request</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRPWR_0</name>
                  <value>0x0</value>
                  <description>Enable INACTIVE mode.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRPWR_1</name>
                  <value>0x1</value>
                  <description>Enable ACTIVE mode.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GCCTL1</name>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <description>General Control Register 1</description>
          <fields>
            <field>
              <name>WPIFG</name>
              <description>[4:4] Write Protection Detection flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WPIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WPIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending. Can be cleared by writing '0' or by reading SYSSNIV when it is the highest pending interrupt.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACCTEIFG</name>
              <description>[3:3] Access time error flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCTEIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCTEIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending. Can be cleared by writing '0' or by reading SYSSNIV when it is the highest pending interrupt.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UBDIFG</name>
              <description>[2:2] FRAM uncorrectable bit error detection flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UBDIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UBDIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending. Can be cleared by writing '0' or by reading SYSSNIV when it is the highest pending interrupt.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBDIFG</name>
              <description>[1:1] FRAM correctable bit error detection flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBDIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt is pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBDIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending. Can be cleared by writing '0' or by reading SYSSNIV if it is the highest pending interrupt.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
