ibuttonlink/msp430fr5962/msp430fr5962.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MPY32</name>
      <baseAddress>0x04C0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MPY</name>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <description>16-bit operand one  multiply</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MPYS</name>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <description>16-bit operand one  signed multiply</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MAC</name>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <description>16-bit operand one  multiply accumulate</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MACS</name>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <description>16-bit operand one  signed multiply accumulate</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>OP2</name>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <description>16-bit operand two</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RESLO</name>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <description>16x16-bit result low word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RESHI</name>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <description>16x16-bit result high word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SUMEXT</name>
          <addressOffset>0xE</addressOffset>
          <size>16</size>
          <description>16x16-bit sum extension register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MPY32L</name>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <description>32-bit operand 1  multiply  low word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MPY32H</name>
          <addressOffset>0x12</addressOffset>
          <size>16</size>
          <description>32-bit operand 1  multiply  high word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MPYS32L</name>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <description>32-bit operand 1  signed multiply  low word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MPYS32H</name>
          <addressOffset>0x16</addressOffset>
          <size>16</size>
          <description>32-bit operand 1  signed multiply  high word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MAC32L</name>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <description>32-bit operand 1  multiply accumulate  low word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MAC32H</name>
          <addressOffset>0x1A</addressOffset>
          <size>16</size>
          <description>32-bit operand 1  multiply accumulate  high word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MACS32L</name>
          <addressOffset>0x1C</addressOffset>
          <size>16</size>
          <description>32-bit operand 1  signed multiply accumulate  low word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MACS32H</name>
          <addressOffset>0x1E</addressOffset>
          <size>16</size>
          <description>32-bit operand 1  signed multiply accumulate  high word</description>
          <fields>
            <field>
              <name>MACS32H</name>
              <description>[15:8] 32-bit operand 1  signed multiply accumulate  high word</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>OP2L</name>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
          <description>32-bit operand 2  low word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>OP2H</name>
          <addressOffset>0x22</addressOffset>
          <size>16</size>
          <description>32-bit operand 2  high word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RES0</name>
          <addressOffset>0x24</addressOffset>
          <size>16</size>
          <description>32x32-bit result 0  least significant word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RES1</name>
          <addressOffset>0x26</addressOffset>
          <size>16</size>
          <description>32x32-bit result 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RES2</name>
          <addressOffset>0x28</addressOffset>
          <size>16</size>
          <description>32x32-bit result 2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RES3</name>
          <addressOffset>0x2A</addressOffset>
          <size>16</size>
          <description>32x32-bit result 3  most significant word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MPY32CTL0</name>
          <addressOffset>0x2C</addressOffset>
          <size>16</size>
          <description>MPY32 control register 0</description>
          <fields>
            <field>
              <name>MPYDLY32</name>
              <description>[9:9] Delayed write mode.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPYDLY32_0</name>
                  <value>0x0</value>
                  <description>Writes are delayed until 64-bit result (RES0 to RES3) is available.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPYDLY32_1</name>
                  <value>0x1</value>
                  <description>Writes are delayed until 32-bit result (RES0 to RES1) is available. 8 MPYDLYWRTEN</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPYDLYWRTEN</name>
              <description>[8:8] Delayed write enable.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPYDLYWRTEN_0</name>
                  <value>0x0</value>
                  <description>Writes are not delayed.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPYDLYWRTEN_1</name>
                  <value>0x1</value>
                  <description>Writes are delayed.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPYOP2_32</name>
              <description>[7:7] Multiplier bit width of operand 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>16</name>
                  <value>0x0</value>
                  <description>16 bits.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <value>0x1</value>
                  <description>32 bits.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPYOP1_32</name>
              <description>[6:6] Multiplier bit width of operand 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>16</name>
                  <value>0x0</value>
                  <description>16 bits.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <value>0x1</value>
                  <description>32 bits.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPYM</name>
              <description>[5:4] Multiplier mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPY</name>
                  <value>0x0</value>
                  <description>MPY  Multiply</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPYS</name>
                  <value>0x1</value>
                  <description>MPYS  Signed multiply</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAC</name>
                  <value>0x2</value>
                  <description>MAC  Multiply accumulate</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MACS</name>
                  <value>0x3</value>
                  <description>MACS  Signed multiply accumulate</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPYSAT</name>
              <description>[3:3] Saturation mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Saturation mode disabled.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Saturation mode enabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPYFRAC</name>
              <description>[2:2] Fractional mode.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Fractional mode disabled.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Fractional mode enabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPYC</name>
              <description>[0:0] Carry of the multiplier</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPYC_0</name>
                  <value>0x0</value>
                  <description>No carry for result.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPYC_1</name>
                  <value>0x1</value>
                  <description>Result has a carry.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
