ibuttonlink/msp430fr5962/msp430fr5962.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RAMCTL</name>
      <baseAddress>0x0158</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>RCCTL0</name>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <description>RAM Controller Control 0</description>
          <fields>
            <field>
              <name>RCRS0OFF</name>
              <description>[1:0] RAM controller RAM sector 0 off</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RCRS0OFF_0</name>
                  <value>0x0</value>
                  <description>Contents of this RAM sector are retained in LPM3 and LPM4.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCRS0OFF_1</name>
                  <value>0x1</value>
                  <description>Turns off this RAM sector in LPM3 and LPM4, re-activates it on wake-up. All data of this RAM sector is lost after wakeup from LPM3 and LPM4. See the device-specific data sheet to find the number of available sectors, the address range, and the size of each RAM sector.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCRS0OFF_2</name>
                  <value>0x2</value>
                  <description>Turns off this RAM sector entering LPM3 and LPM4, the RAM sector remains off after wake-up. All data of this RAM sector is lost. See the devicespecific data sheet to find the number of available sectors, the address range, and the size of each RAM sector.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCKEY</name>
              <description>[15:8] RAM controller key. Always reads as 69h. Must be written as 5Ah; any other write is is ignored.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RCRS1OFF</name>
              <description>[3:2] RAM controller RAM sector 0 off</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RCRS0OFF_0</name>
                  <value>0x0</value>
                  <description>Contents of this RAM sector are retained in LPM3 and LPM4.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCRS0OFF_1</name>
                  <value>0x1</value>
                  <description>Turns off this RAM sector in LPM3 and LPM4, re-activates it on wake-up. All data of this RAM sector is lost after wakeup from LPM3 and LPM4. See the device-specific data sheet to find the number of available sectors, the address range, and the size of each RAM sector.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCRS0OFF_2</name>
                  <value>0x2</value>
                  <description>Turns off this RAM sector entering LPM3 and LPM4, the RAM sector remains off after wake-up. All data of this RAM sector is lost. See the devicespecific data sheet to find the number of available sectors, the address range, and the size of each RAM sector.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCRS3OFF</name>
              <description>[7:6] RAM controller RAM sector 3 off</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RCRS0OFF_0</name>
                  <value>0x0</value>
                  <description>Contents of this RAM sector are retained in LPM3 and LPM4.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCRS0OFF_1</name>
                  <value>0x1</value>
                  <description>Turns off this RAM sector in LPM3 and LPM4, re-activates it on wake-up. All data of this RAM sector is lost after wakeup from LPM3 and LPM4. See the device-specific data sheet to find the number of available sectors, the address range, and the size of each RAM sector.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCRS0OFF_2</name>
                  <value>0x2</value>
                  <description>Turns off this RAM sector entering LPM3 and LPM4, the RAM sector remains off after wake-up. All data of this RAM sector is lost. See the devicespecific data sheet to find the number of available sectors, the address range, and the size of each RAM sector.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCRS2OFF</name>
              <description>[5:4] RAM controller RAM sector 0 off</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RCRS0OFF_0</name>
                  <value>0x0</value>
                  <description>Contents of this RAM sector are retained in LPM3 and LPM4.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCRS0OFF_1</name>
                  <value>0x1</value>
                  <description>Turns off this RAM sector in LPM3 and LPM4, re-activates it on wake-up. All data of this RAM sector is lost after wakeup from LPM3 and LPM4. See the device-specific data sheet to find the number of available sectors, the address range, and the size of each RAM sector.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCRS0OFF_2</name>
                  <value>0x2</value>
                  <description>Turns off this RAM sector entering LPM3 and LPM4, the RAM sector remains off after wake-up. All data of this RAM sector is lost. See the devicespecific data sheet to find the number of available sectors, the address range, and the size of each RAM sector.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
