ibuttonlink/msp430fr5962/msp430fr5962.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RTC_C</name>
      <baseAddress>0x04A0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>RTCCTL0</name>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <description>RTCCTL0 Register</description>
          <fields>
            <field>
              <name>RTCRDYIFG</name>
              <description>[0:0] Real-time clock ready interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>RTCAIFG</name>
              <description>[1:1] Real-time clock alarm interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RTCTEVIFG</name>
              <description>[2:2] Real-time clock time event interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RTCOFIFG</name>
              <description>[3:3] 32-kHz crystal oscillator fault interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RTCRDYIE</name>
              <description>[4:4] Real-time clock ready interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RTCAIE</name>
              <description>[5:5] Real-time clock alarm interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>RTCTEVIE</name>
              <description>[6:6] Real-time clock time event interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>RTCOFIE</name>
              <description>[7:7] 32-kHz crystal oscillator fault interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>RTCKEY</name>
              <description>[15:8] Real-time clock key</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCCTL13</name>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <description>RTCCTL13 Register</description>
          <fields>
            <field>
              <name>RTCTEV</name>
              <description>[1:0] Real-time clock time event</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIN</name>
                  <value>0x0</value>
                  <description>Minute changed</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOUR</name>
                  <value>0x1</value>
                  <description>Hour changed</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000</name>
                  <value>0x2</value>
                  <description>Every day at midnight (00:00)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1200</name>
                  <value>0x3</value>
                  <description>Every day at noon (12:00)</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCSSEL</name>
              <description>[3:2] Real-time clock source select</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFXT</name>
                  <value>0x0</value>
                  <description>32-kHz crystal oscillator clock</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXT_</name>
                  <value>0x1</value>
                  <description>32-kHz crystal oscillator clock</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1PS</name>
                  <value>0x2</value>
                  <description>Output from RT1PS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1PS_</name>
                  <value>0x3</value>
                  <description>Output from RT1PS</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCRDY</name>
              <description>[4:4] Real-time clock ready</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTCRDY_0</name>
                  <value>0x0</value>
                  <description>RTC time values in transition</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCRDY_1</name>
                  <value>0x1</value>
                  <description>RTC time values safe for reading. This bit indicates when the real-time clock time values are safe for reading.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCMODE</name>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTCMODE_1</name>
                  <value>0x1</value>
                  <description>Calendar mode. Always reads a value of 1.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCHOLD</name>
              <description>[6:6] Real-time clock hold</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTCHOLD_0</name>
                  <value>0x0</value>
                  <description>Real-time clock is operational</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCHOLD_1</name>
                  <value>0x1</value>
                  <description>When set, the calendar is stopped as well as the prescale counters, RT0PS and RT1PS are don't care</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCBCD</name>
              <description>[7:7] Real-time clock BCD select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HEX</name>
                  <value>0x0</value>
                  <description>Binary (hexadecimal) code selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BCD</name>
                  <value>0x1</value>
                  <description>Binary coded decimal (BCD) code selected</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCCALF</name>
              <description>[9:8] Real-time clock calibration frequency</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No frequency output to RTCCLK pin</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512</name>
                  <value>0x1</value>
                  <description>512 Hz</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <value>0x2</value>
                  <description>256 Hz</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>0x3</value>
                  <description>1 Hz</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCOCAL</name>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <description>RTCOCAL Register</description>
          <fields>
            <field>
              <name>RTCOCAL</name>
              <description>[7:0] Real-time clock offset error calibration</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>RTCOCALS</name>
              <description>[15:15] Real-time clock offset error calibration sign</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DOWN</name>
                  <value>0x0</value>
                  <description>Down calibration. Frequency adjusted down.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UP</name>
                  <value>0x1</value>
                  <description>Up calibration. Frequency adjusted up.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCTCMP</name>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <description>RTCTCMP Register</description>
          <fields>
            <field>
              <name>RTCTCMP</name>
              <description>[7:0] Real-time clock temperature compensation</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>RTCTCOK</name>
              <description>[13:13] Real-time clock temperature compensation write OK</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTCTCOK_0</name>
                  <value>0x0</value>
                  <description>Write to RTCTCMPx is unsuccessful</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCTCOK_1</name>
                  <value>0x1</value>
                  <description>Write to RTCTCMPx is successful</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCTCRDY</name>
              <description>[14:14] Real-time clock temperature compensation ready</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>RTCTCMPS</name>
              <description>[15:15] Real-time clock temperature compensation sign</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DOWN</name>
                  <value>0x0</value>
                  <description>Down calibration. Frequency adjusted down</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UP</name>
                  <value>0x1</value>
                  <description>Up calibration. Frequency adjusted up</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCPS0CTL</name>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <description>Real-Time Clock Prescale Timer 0 Control Register</description>
          <fields>
            <field>
              <name>RT0PSIFG</name>
              <description>[0:0] Prescale timer 0 interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RT0PSIFG_0</name>
                  <value>0x0</value>
                  <description>No time event occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0PSIFG_1</name>
                  <value>0x1</value>
                  <description>Time event occurred</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT0PSIE</name>
              <description>[1:1] Prescale timer 0 interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Interrupt not enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Interrupt enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT0IP</name>
              <description>[4:2] Prescale timer 0 interrupt interval</description>
              <bitWidth>3</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2</name>
                  <value>0x0</value>
                  <description>Divide by 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <value>0x1</value>
                  <description>Divide by 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <value>0x2</value>
                  <description>Divide by 8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <value>0x3</value>
                  <description>Divide by 16</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <value>0x4</value>
                  <description>Divide by 32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <value>0x5</value>
                  <description>Divide by 64</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <value>0x6</value>
                  <description>Divide by 128</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <value>0x7</value>
                  <description>Divide by 256</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT0PSHOLD</name>
              <description>[8:8] Prescale timer 0 hold</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RT0PSHOLD_0</name>
                  <value>0x0</value>
                  <description>RT0PS is operational</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0PSHOLD_1</name>
                  <value>0x1</value>
                  <description>RT0PS is held</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT0PSDIV</name>
              <description>[13:11] Prescale timer 0 clock divide</description>
              <bitWidth>3</bitWidth>
              <bitOffset>11</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2</name>
                  <value>0x0</value>
                  <description>Divide by 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <value>0x1</value>
                  <description>Divide by 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <value>0x2</value>
                  <description>Divide by 8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <value>0x3</value>
                  <description>Divide by 16</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <value>0x4</value>
                  <description>Divide by 32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <value>0x5</value>
                  <description>Divide by 64</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <value>0x6</value>
                  <description>Divide by 128</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <value>0x7</value>
                  <description>Divide by 256</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
