ibuttonlink/msp430fr5962/msp430fr5962.svd
        <register>
          <name>TA0CCTL2</name>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <description>Timer_A Capture/Compare Control Register</description>
          <fields>
            <field>
              <name>CCIFG</name>
              <description>[0:0] Capture/compare interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COV</name>
              <description>[1:1] Capture overflow</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COV_0</name>
                  <value>0x0</value>
                  <description>No capture overflow occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COV_1</name>
                  <value>0x1</value>
                  <description>Capture overflow occurred</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUT</name>
              <description>[2:2] Output</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>0x0</value>
                  <description>Output low</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0x1</value>
                  <description>Output high</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCI</name>
              <description>[3:3] Capture/compare input</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CCIE</name>
              <description>[4:4] Capture/compare interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIE_0</name>
                  <value>0x0</value>
                  <description>Interrupt disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIE_1</name>
                  <value>0x1</value>
                  <description>Interrupt enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTMOD</name>
              <description>[7:5] Output mode</description>
              <bitWidth>3</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTMOD_0</name>
                  <value>0x0</value>
                  <description>OUT bit value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_1</name>
                  <value>0x1</value>
                  <description>Set</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_2</name>
                  <value>0x2</value>
                  <description>Toggle/reset</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_3</name>
                  <value>0x3</value>
                  <description>Set/reset</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_4</name>
                  <value>0x4</value>
                  <description>Toggle</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_5</name>
                  <value>0x5</value>
                  <description>Reset</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_6</name>
                  <value>0x6</value>
                  <description>Toggle/set</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_7</name>
                  <value>0x7</value>
                  <description>Reset/set</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP</name>
              <description>[8:8] Capture mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARE</name>
                  <value>0x0</value>
                  <description>Compare mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTURE</name>
                  <value>0x1</value>
                  <description>Capture mode</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCCI</name>
              <description>[10:10] Synchronized capture/compare input</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>SCS</name>
              <description>[11:11] Synchronize capture source</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ASYNC</name>
                  <value>0x0</value>
                  <description>Asynchronous capture</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC</name>
                  <value>0x1</value>
                  <description>Synchronous capture</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCIS</name>
              <description>[13:12] Capture/compare input select</description>
              <bitWidth>2</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIA</name>
                  <value>0x0</value>
                  <description>CCIxA</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIB</name>
                  <value>0x1</value>
                  <description>CCIxB</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GND</name>
                  <value>0x2</value>
                  <description>GND</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VCC</name>
                  <value>0x3</value>
                  <description>VCC</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM</name>
              <description>[15:14] Capture mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>14</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No capture</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <value>0x1</value>
                  <description>Capture on rising edge</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <value>0x2</value>
                  <description>Capture on falling edge</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <value>0x3</value>
                  <description>Capture on both rising and falling edges</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TA0R</name>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <description>TimerA register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TA0CCR0</name>
          <addressOffset>0x12</addressOffset>
          <size>16</size>
          <description>Timer_A Capture/Compare  Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TA0CCR1</name>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <description>Timer_A Capture/Compare  Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TA0CCR2</name>
          <addressOffset>0x16</addressOffset>
          <size>16</size>
          <description>Timer_A Capture/Compare  Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TA0EX0</name>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
          <description>TimerAx Expansion 0 Register</description>
          <fields>
            <field>
              <name>TAIDEX</name>
              <description>[2:0] Input divider expansion</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <value>0x0</value>
                  <description>Divide by 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>0x1</value>
                  <description>Divide by 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>0x2</value>
                  <description>Divide by 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <value>0x3</value>
                  <description>Divide by 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <value>0x4</value>
                  <description>Divide by 5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <value>0x5</value>
                  <description>Divide by 6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <value>0x6</value>
                  <description>Divide by 7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <value>0x7</value>
                  <description>Divide by 8</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TA0IV</name>
          <addressOffset>0x2E</addressOffset>
          <size>16</size>
          <description>TimerAx Interrupt Vector Register</description>
          <fields>
            <field>
              <name>TAIV</name>
              <description>[15:0] TimerA interrupt vector value</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TACCR1</name>
                  <value>0x2</value>
                  <description>Interrupt Source: Capture/compare 1; Interrupt Flag: TAxCCR1 CCIFG; Interrupt Priority: Highest</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TACCR2</name>
                  <value>0x4</value>
                  <description>Interrupt Source: Capture/compare 2; Interrupt Flag: TAxCCR2 CCIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TACCR3</name>
                  <value>0x6</value>
                  <description>Interrupt Source: Capture/compare 3; Interrupt Flag: TAxCCR3 CCIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TACCR4</name>
                  <value>0x8</value>
                  <description>Interrupt Source: Capture/compare 4; Interrupt Flag: TAxCCR4 CCIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TACCR5</name>
                  <value>0xA</value>
                  <description>Interrupt Source: Capture/compare 5; Interrupt Flag: TAxCCR5 CCIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TACCR6</name>
                  <value>0xC</value>
                  <description>Interrupt Source: Capture/compare 6; Interrupt Flag: TAxCCR6 CCIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TAIFG</name>
                  <value>0xE</value>
                  <description>Interrupt Source: Timer overflow; Interrupt Flag: TAxCTL TAIFG; Interrupt Priority: Lowest</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
