ibuttonlink/msp430fr5962/msp430fr5962.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TA1</name>
      <baseAddress>0x0380</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>TA1CTL</name>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <description>TimerAx Control Register</description>
          <fields>
            <field>
              <name>TAIFG</name>
              <description>[0:0] TimerA interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TAIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TAIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAIE</name>
              <description>[1:1] TimerA interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TAIE_0</name>
                  <value>0x0</value>
                  <description>Interrupt disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TAIE_1</name>
                  <value>0x1</value>
                  <description>Interrupt enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TACLR</name>
              <description>[2:2] TimerA clear</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>MC</name>
              <description>[5:4] Mode control</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <value>0x0</value>
                  <description>Stop mode: Timer is halted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UP</name>
                  <value>0x1</value>
                  <description>Up mode: Timer counts up to TAxCCR0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <value>0x2</value>
                  <description>Continuous mode: Timer counts up to 0FFFFh</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDOWN</name>
                  <value>0x3</value>
                  <description>Up/down mode: Timer counts up to TAxCCR0 then down to 0000h</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ID</name>
              <description>[7:6] Input divider</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <value>0x0</value>
                  <description>/1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>0x1</value>
                  <description>/2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <value>0x2</value>
                  <description>/4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <value>0x3</value>
                  <description>/8</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TASSEL</name>
              <description>[9:8] TimerA clock source select</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TACLK</name>
                  <value>0x0</value>
                  <description>TAxCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACLK</name>
                  <value>0x1</value>
                  <description>ACLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMCLK</name>
                  <value>0x2</value>
                  <description>SMCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCLK</name>
                  <value>0x3</value>
                  <description>INCLK</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TA1CCTL0</name>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <description>Timer_A Capture/Compare Control Register</description>
          <fields>
            <field>
              <name>CCIFG</name>
              <description>[0:0] Capture/compare interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COV</name>
              <description>[1:1] Capture overflow</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COV_0</name>
                  <value>0x0</value>
                  <description>No capture overflow occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COV_1</name>
                  <value>0x1</value>
                  <description>Capture overflow occurred</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUT</name>
              <description>[2:2] Output</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>0x0</value>
                  <description>Output low</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0x1</value>
                  <description>Output high</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCI</name>
              <description>[3:3] Capture/compare input</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CCIE</name>
              <description>[4:4] Capture/compare interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIE_0</name>
                  <value>0x0</value>
                  <description>Interrupt disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIE_1</name>
                  <value>0x1</value>
                  <description>Interrupt enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTMOD</name>
              <description>[7:5] Output mode</description>
              <bitWidth>3</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTMOD_0</name>
                  <value>0x0</value>
                  <description>OUT bit value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_1</name>
                  <value>0x1</value>
                  <description>Set</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_2</name>
                  <value>0x2</value>
                  <description>Toggle/reset</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_3</name>
                  <value>0x3</value>
                  <description>Set/reset</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_4</name>
                  <value>0x4</value>
                  <description>Toggle</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_5</name>
                  <value>0x5</value>
                  <description>Reset</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_6</name>
                  <value>0x6</value>
                  <description>Toggle/set</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_7</name>
                  <value>0x7</value>
                  <description>Reset/set</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP</name>
              <description>[8:8] Capture mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARE</name>
                  <value>0x0</value>
                  <description>Compare mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTURE</name>
                  <value>0x1</value>
                  <description>Capture mode</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCCI</name>
              <description>[10:10] Synchronized capture/compare input</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>SCS</name>
              <description>[11:11] Synchronize capture source</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ASYNC</name>
                  <value>0x0</value>
                  <description>Asynchronous capture</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC</name>
                  <value>0x1</value>
                  <description>Synchronous capture</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCIS</name>
              <description>[13:12] Capture/compare input select</description>
              <bitWidth>2</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIA</name>
                  <value>0x0</value>
                  <description>CCIxA</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIB</name>
                  <value>0x1</value>
                  <description>CCIxB</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GND</name>
                  <value>0x2</value>
                  <description>GND</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VCC</name>
                  <value>0x3</value>
                  <description>VCC</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM</name>
              <description>[15:14] Capture mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>14</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No capture</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <value>0x1</value>
                  <description>Capture on rising edge</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <value>0x2</value>
                  <description>Capture on falling edge</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <value>0x3</value>
                  <description>Capture on both rising and falling edges</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TA1CCTL1</name>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <description>Timer_A Capture/Compare Control Register</description>
          <fields>
            <field>
              <name>CCIFG</name>
              <description>[0:0] Capture/compare interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COV</name>
              <description>[1:1] Capture overflow</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COV_0</name>
                  <value>0x0</value>
                  <description>No capture overflow occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COV_1</name>
                  <value>0x1</value>
                  <description>Capture overflow occurred</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUT</name>
              <description>[2:2] Output</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>0x0</value>
                  <description>Output low</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0x1</value>
                  <description>Output high</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCI</name>
              <description>[3:3] Capture/compare input</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CCIE</name>
              <description>[4:4] Capture/compare interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIE_0</name>
                  <value>0x0</value>
                  <description>Interrupt disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIE_1</name>
                  <value>0x1</value>
                  <description>Interrupt enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTMOD</name>
              <description>[7:5] Output mode</description>
              <bitWidth>3</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTMOD_0</name>
                  <value>0x0</value>
                  <description>OUT bit value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_1</name>
                  <value>0x1</value>
                  <description>Set</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_2</name>
                  <value>0x2</value>
                  <description>Toggle/reset</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_3</name>
                  <value>0x3</value>
                  <description>Set/reset</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_4</name>
                  <value>0x4</value>
                  <description>Toggle</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_5</name>
                  <value>0x5</value>
                  <description>Reset</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_6</name>
                  <value>0x6</value>
                  <description>Toggle/set</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_7</name>
                  <value>0x7</value>
                  <description>Reset/set</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP</name>
              <description>[8:8] Capture mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARE</name>
                  <value>0x0</value>
                  <description>Compare mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTURE</name>
                  <value>0x1</value>
                  <description>Capture mode</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCCI</name>
              <description>[10:10] Synchronized capture/compare input</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>SCS</name>
              <description>[11:11] Synchronize capture source</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ASYNC</name>
                  <value>0x0</value>
                  <description>Asynchronous capture</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC</name>
                  <value>0x1</value>
                  <description>Synchronous capture</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCIS</name>
              <description>[13:12] Capture/compare input select</description>
              <bitWidth>2</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIA</name>
                  <value>0x0</value>
                  <description>CCIxA</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIB</name>
                  <value>0x1</value>
                  <description>CCIxB</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GND</name>
                  <value>0x2</value>
                  <description>GND</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VCC</name>
                  <value>0x3</value>
                  <description>VCC</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM</name>
              <description>[15:14] Capture mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>14</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No capture</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <value>0x1</value>
                  <description>Capture on rising edge</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <value>0x2</value>
                  <description>Capture on falling edge</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <value>0x3</value>
                  <description>Capture on both rising and falling edges</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
