ibuttonlink/msp430fr5962/msp430fr5962.svd
        <register>
          <name>TB0EX0</name>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
          <description>Timer_Bx Expansion Register 0</description>
          <fields>
            <field>
              <name>TBIDEX</name>
              <description>[2:0] Input divider expansion</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <value>0x0</value>
                  <description>Divide by 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>0x1</value>
                  <description>Divide by 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>0x2</value>
                  <description>Divide by 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <value>0x3</value>
                  <description>Divide by 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <value>0x4</value>
                  <description>Divide by 5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <value>0x5</value>
                  <description>Divide by 6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <value>0x6</value>
                  <description>Divide by 7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <value>0x7</value>
                  <description>Divide by 8</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TB0IV</name>
          <addressOffset>0x2E</addressOffset>
          <size>16</size>
          <description>Timer_Bx Interrupt Vector Register</description>
          <fields>
            <field>
              <name>TBIV</name>
              <description>[15:0] Timer_B interrupt vector value</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR1</name>
                  <value>0x2</value>
                  <description>Interrupt Source: Capture/compare 1; Interrupt Flag: TBxCCR1 CCIFG; Interrupt Priority: Highest</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR2</name>
                  <value>0x4</value>
                  <description>Interrupt Source: Capture/compare 2; Interrupt Flag: TBxCCR2 CCIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR3</name>
                  <value>0x6</value>
                  <description>Interrupt Source: Capture/compare 3; Interrupt Flag: TBxCCR3 CCIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR4</name>
                  <value>0x8</value>
                  <description>Interrupt Source: Capture/compare 4; Interrupt Flag: TBxCCR4 CCIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR5</name>
                  <value>0xA</value>
                  <description>Interrupt Source: Capture/compare 5; Interrupt Flag: TBxCCR5 CCIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR6</name>
                  <value>0xC</value>
                  <description>Interrupt Source: Capture/compare 6; Interrupt Flag: TBxCCR6 CCIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBIFG</name>
                  <value>0xE</value>
                  <description>Interrupt Source: Timer overflow; Interrupt Flag: TBxCTL TBIFG; Interrupt Priority: Lowest</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WDT_A</name>
      <baseAddress>0x015C</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>WDTCTL</name>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <description>Watchdog Timer Control Register</description>
          <fields>
            <field>
              <name>WDTIS</name>
              <description>[2:0] Watchdog timer interval select</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2G</name>
                  <value>0x0</value>
                  <description>Watchdog clock source / (2^(31)) (18:12:16 at 32.768 kHz)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128M</name>
                  <value>0x1</value>
                  <description>Watchdog clock source /(2^(27)) (01:08:16 at 32.768 kHz)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8192K</name>
                  <value>0x2</value>
                  <description>Watchdog clock source /(2^(23)) (00:04:16 at 32.768 kHz)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512K</name>
                  <value>0x3</value>
                  <description>Watchdog clock source /(2^(19)) (00:00:16 at 32.768 kHz)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32K</name>
                  <value>0x4</value>
                  <description>Watchdog clock source /(2^(15)) (1 s at 32.768 kHz)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8192</name>
                  <value>0x5</value>
                  <description>Watchdog clock source / (2^(13)) (250 ms at 32.768 kHz)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512</name>
                  <value>0x6</value>
                  <description>Watchdog clock source / (2^(9)) (15.625 ms at 32.768 kHz)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <value>0x7</value>
                  <description>Watchdog clock source / (2^(6)) (1.95 ms at 32.768 kHz)</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDTCNTCL</name>
              <description>[3:3] Watchdog timer counter clear</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDTCNTCL_0</name>
                  <value>0x0</value>
                  <description>No action</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTCNTCL_1</name>
                  <value>0x1</value>
                  <description>WDTCNT = 0000h</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDTTMSEL</name>
              <description>[4:4] Watchdog timer mode select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDTTMSEL_0</name>
                  <value>0x0</value>
                  <description>Watchdog mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTTMSEL_1</name>
                  <value>0x1</value>
                  <description>Interval timer mode</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDTSSEL</name>
              <description>[6:5] Watchdog timer clock source select</description>
              <bitWidth>2</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SMCLK</name>
                  <value>0x0</value>
                  <description>SMCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACLK</name>
                  <value>0x1</value>
                  <description>ACLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLOCLK</name>
                  <value>0x2</value>
                  <description>VLOCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BCLK</name>
                  <value>0x3</value>
                  <description>BCLK</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDTHOLD</name>
              <description>[7:7] Watchdog timer hold</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNHOLD</name>
                  <value>0x0</value>
                  <description>Watchdog timer is not stopped</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOLD</name>
                  <value>0x1</value>
                  <description>Watchdog timer is stopped</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDTPW</name>
              <description>[15:8] Watchdog timer password</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
