ibuttonlink/msp430fr5962/msp430fr5962.svd
        <register>
          <name>UCA0IFG</name>
          <addressOffset>0x1C</addressOffset>
          <size>16</size>
          <description>eUSCI_Ax Interrupt Flag Register</description>
          <fields>
            <field>
              <name>UCRXIFG</name>
              <description>[0:0] Receive interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCRXIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCTXIFG</name>
              <description>[1:1] Transmit interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCTXIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCSTTIFG</name>
              <description>[2:2] Start bit interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCSTTIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSTTIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCTXCPTIFG</name>
              <description>[3:3] Transmit ready interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCTXCPTIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXCPTIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA0IFG_SPI</name>
          <addressOffset>0x1C</addressOffset>
          <size>16</size>
          <description>eUSCI_Ax Interrupt Flag Register</description>
          <fields>
            <field>
              <name>UCRXIFG</name>
              <description>[0:0] Receive interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCRXIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCTXIFG</name>
              <description>[1:1] Transmit interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCTXIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA0IV</name>
          <addressOffset>0x1E</addressOffset>
          <size>16</size>
          <description>eUSCI_Ax Interrupt Vector Register</description>
          <fields>
            <field>
              <name>UCIV</name>
              <description>[15:0] eUSCI_A interrupt vector value</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIFG</name>
                  <value>0x2</value>
                  <description>Interrupt Source: Receive buffer full; Interrupt Flag: UCRXIFG; Interrupt Priority: Highest</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIFG</name>
                  <value>0x4</value>
                  <description>Interrupt Source: Transmit buffer empty; Interrupt Flag: UCTXIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSTTIFG</name>
                  <value>0x6</value>
                  <description>Interrupt Source: Start bit received; Interrupt Flag: UCSTTIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXCPTIFG</name>
                  <value>0x8</value>
                  <description>Interrupt Source: Transmit complete; Interrupt Flag: UCTXCPTIFG; Interrupt Priority: Lowest</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA0IV_SPI</name>
          <addressOffset>0x1E</addressOffset>
          <size>16</size>
          <description>eUSCI_Ax Interrupt Vector Register</description>
          <fields>
            <field>
              <name>UCIV</name>
              <description>[15:0] eUSCI_A interrupt vector value</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIFG</name>
                  <value>0x2</value>
                  <description>Interrupt Source: Data received; Interrupt Flag: UCRXIFG; Interrupt Priority: Highest</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIFG</name>
                  <value>0x4</value>
                  <description>Interrupt Source: Transmit buffer empty; Interrupt Flag: UCTXIFG; Interrupt Priority: Lowest</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
