ibuttonlink/msp430fr5962/msp430fr5962.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>eUSCI_A1</name>
      <baseAddress>0x05E0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>UCA1CTLW0</name>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <description>eUSCI_Ax Control Word Register 0</description>
          <fields>
            <field>
              <name>UCSWRST</name>
              <description>[0:0] Software reset enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Disabled. eUSCI_A reset released for operation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Enabled. eUSCI_A logic held in reset state</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCTXBRK</name>
              <description>[1:1] Transmit break</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCTXBRK_0</name>
                  <value>0x0</value>
                  <description>Next frame transmitted is not a break</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXBRK_1</name>
                  <value>0x1</value>
                  <description>Next frame transmitted is a break or a break/synch</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCTXADDR</name>
              <description>[2:2] Transmit address</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCTXADDR_0</name>
                  <value>0x0</value>
                  <description>Next frame transmitted is data</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXADDR_1</name>
                  <value>0x1</value>
                  <description>Next frame transmitted is an address</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCDORM</name>
              <description>[3:3] Dormant</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCDORM_0</name>
                  <value>0x0</value>
                  <description>Not dormant. All received characters set UCRXIFG.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCDORM_1</name>
                  <value>0x1</value>
                  <description>Dormant. Only characters that are preceded by an idle-line or with address bit set UCRXIFG. In UART mode with automatic baud-rate detection, only the combination of a break and synch field sets UCRXIFG.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCBRKIE</name>
              <description>[4:4] Receive break character interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCBRKIE_0</name>
                  <value>0x0</value>
                  <description>Received break characters do not set UCRXIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRKIE_1</name>
                  <value>0x1</value>
                  <description>Received break characters set UCRXIFG</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCRXEIE</name>
              <description>[5:5] Receive erroneous-character interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCRXEIE_0</name>
                  <value>0x0</value>
                  <description>Erroneous characters rejected and UCRXIFG is not set</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXEIE_1</name>
                  <value>0x1</value>
                  <description>Erroneous characters received set UCRXIFG</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCSSEL</name>
              <description>[7:6] eUSCI_A clock source select</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCLK</name>
                  <value>0x0</value>
                  <description>UCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACLK</name>
                  <value>0x1</value>
                  <description>ACLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMCLK</name>
                  <value>0x2</value>
                  <description>SMCLK</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCSYNC</name>
              <description>[8:8] Synchronous mode enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ASYNC</name>
                  <value>0x0</value>
                  <description>Asynchronous mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC</name>
                  <value>0x1</value>
                  <description>Synchronous mode</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCMODE</name>
              <description>[10:9] eUSCI_A mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>9</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCMODE_0</name>
                  <value>0x0</value>
                  <description>UART mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_1</name>
                  <value>0x1</value>
                  <description>Idle-line multiprocessor mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_2</name>
                  <value>0x2</value>
                  <description>Address-bit multiprocessor mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_3</name>
                  <value>0x3</value>
                  <description>UART mode with automatic baud-rate detection</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCSPB</name>
              <description>[11:11] Stop bit select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCSPB_0</name>
                  <value>0x0</value>
                  <description>One stop bit</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSPB_1</name>
                  <value>0x1</value>
                  <description>Two stop bits</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UC7BIT</name>
              <description>[12:12] Character length</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8BIT</name>
                  <value>0x0</value>
                  <description>8-bit data</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7BIT</name>
                  <value>0x1</value>
                  <description>7-bit data</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCMSB</name>
              <description>[13:13] MSB first select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCMSB_0</name>
                  <value>0x0</value>
                  <description>LSB first</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMSB_1</name>
                  <value>0x1</value>
                  <description>MSB first</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCPAR</name>
              <description>[14:14] Parity select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ODD</name>
                  <value>0x0</value>
                  <description>Odd parity</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVEN</name>
                  <value>0x1</value>
                  <description>Even parity</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCPEN</name>
              <description>[15:15] Parity enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCPEN_0</name>
                  <value>0x0</value>
                  <description>Parity disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCPEN_1</name>
                  <value>0x1</value>
                  <description>Parity enabled. Parity bit is generated (UCAxTXD) and expected (UCAxRXD). In address-bit multiprocessor mode, the address bit is included in the parity calculation.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA1CTLW0_SPI</name>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <description>eUSCI_Ax Control Word Register 0</description>
          <fields>
            <field>
              <name>UCSWRST</name>
              <description>[0:0] Software reset enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Disabled. eUSCI_A reset released for operation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Enabled. eUSCI_A logic held in reset state</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCSTEM</name>
              <description>[1:1] STE mode select in master mode.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCSTEM_0</name>
                  <value>0x0</value>
                  <description>STE pin is used to prevent conflicts with other masters</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSTEM_1</name>
                  <value>0x1</value>
                  <description>STE pin is used to generate the enable signal for a 4-wire slave</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCSSEL</name>
              <description>[7:6] eUSCI_A clock source select</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCSSEL_0</name>
                  <value>0x0</value>
                  <description>Reserved</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACLK</name>
                  <value>0x1</value>
                  <description>ACLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMCLK</name>
                  <value>0x2</value>
                  <description>SMCLK</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCSYNC</name>
              <description>[8:8] Synchronous mode enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ASYNC</name>
                  <value>0x0</value>
                  <description>Asynchronous mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC</name>
                  <value>0x1</value>
                  <description>Synchronous mode</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCMODE</name>
              <description>[10:9] eUSCI mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>9</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCMODE_0</name>
                  <value>0x0</value>
                  <description>3-pin SPI</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_1</name>
                  <value>0x1</value>
                  <description>4-pin SPI with UCxSTE active high: Slave enabled when UCxSTE = 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_2</name>
                  <value>0x2</value>
                  <description>4-pin SPI with UCxSTE active low: Slave enabled when UCxSTE = 0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCMST</name>
              <description>[11:11] Master mode select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLAVE</name>
                  <value>0x0</value>
                  <description>Slave mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER</name>
                  <value>0x1</value>
                  <description>Master mode</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UC7BIT</name>
              <description>[12:12] Character length</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8BIT</name>
                  <value>0x0</value>
                  <description>8-bit data</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7BIT</name>
                  <value>0x1</value>
                  <description>7-bit data</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCMSB</name>
              <description>[13:13] MSB first select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCMSB_0</name>
                  <value>0x0</value>
                  <description>LSB first</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMSB_1</name>
                  <value>0x1</value>
                  <description>MSB first</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCCKPL</name>
              <description>[14:14] Clock polarity select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>0x0</value>
                  <description>The inactive state is low</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0x1</value>
                  <description>The inactive state is high</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCCKPH</name>
              <description>[15:15] Clock phase select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCCKPH_0</name>
                  <value>0x0</value>
                  <description>Data is changed on the first UCLK edge and captured on the following edge.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCCKPH_1</name>
                  <value>0x1</value>
                  <description>Data is captured on the first UCLK edge and changed on the following edge.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA1CTLW1</name>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <description>eUSCI_Ax Control Word Register 1</description>
          <fields>
            <field>
              <name>UCGLIT</name>
              <description>[1:0] Deglitch time</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCGLIT_0</name>
                  <value>0x0</value>
                  <description>Approximately 2 ns (equivalent of 1 delay element)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCGLIT_1</name>
                  <value>0x1</value>
                  <description>Approximately 50 ns</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCGLIT_2</name>
                  <value>0x2</value>
                  <description>Approximately 100 ns</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCGLIT_3</name>
                  <value>0x3</value>
                  <description>Approximately 200 ns</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA1BRW</name>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <description>eUSCI_Ax Baud Rate Control Word Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA1BRW_SPI</name>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <description>eUSCI_Ax Bit Rate Control Register 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA1MCTLW</name>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <description>eUSCI_Ax Modulation Control Word Register</description>
          <fields>
            <field>
              <name>UCOS16</name>
              <description>[0:0] Oversampling mode enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCOS16_0</name>
                  <value>0x0</value>
                  <description>Disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCOS16_1</name>
                  <value>0x1</value>
                  <description>Enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCBRF</name>
              <description>[7:4] First modulation stage select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>UCBRS</name>
              <description>[15:8] Second modulation stage select</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
