ibuttonlink/msp430fr5962/msp430fr5962.svd
        <register>
          <name>UCB2IFG_SPI</name>
          <addressOffset>0x2C</addressOffset>
          <size>16</size>
          <description>eUSCI_Bx Interrupt Flag Register</description>
          <fields>
            <field>
              <name>UCRXIFG</name>
              <description>[0:0] Receive interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCRXIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCTXIFG</name>
              <description>[1:1] Transmit interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCTXIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB2IV</name>
          <addressOffset>0x2E</addressOffset>
          <size>16</size>
          <description>eUSCI_Bx Interrupt Vector Register</description>
          <fields>
            <field>
              <name>UCIV</name>
              <description>[15:0] eUSCI_B interrupt vector value</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCALIFG</name>
                  <value>0x2</value>
                  <description>Interrupt Source: Arbitration lost; Interrupt Flag: UCALIFG; Interrupt Priority: Highest</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCNACKIFG</name>
                  <value>0x4</value>
                  <description>Interrupt Source: Not acknowledgment; Interrupt Flag: UCNACKIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSTTIFG</name>
                  <value>0x6</value>
                  <description>Interrupt Source: Start condition received; Interrupt Flag: UCSTTIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSTPIFG</name>
                  <value>0x8</value>
                  <description>Interrupt Source: Stop condition received; Interrupt Flag: UCSTPIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIFG3</name>
                  <value>0xA</value>
                  <description>Interrupt Source: Slave 3 Data received; Interrupt Flag: UCRXIFG3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIFG3</name>
                  <value>0xC</value>
                  <description>Interrupt Source: Slave 3 Transmit buffer empty; Interrupt Flag: UCTXIFG3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIFG2</name>
                  <value>0xE</value>
                  <description>Interrupt Source: Slave 2 Data received; Interrupt Flag: UCRXIFG2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIFG2</name>
                  <value>0x10</value>
                  <description>Interrupt Source: Slave 2 Transmit buffer empty; Interrupt Flag: UCTXIFG2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIFG1</name>
                  <value>0x12</value>
                  <description>Interrupt Source: Slave 1 Data received; Interrupt Flag: UCRXIFG1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIFG1</name>
                  <value>0x14</value>
                  <description>Interrupt Source: Slave 1 Transmit buffer empty; Interrupt Flag: UCTXIFG1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIFG0</name>
                  <value>0x16</value>
                  <description>Interrupt Source: Data received; Interrupt Flag: UCRXIFG0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIFG0</name>
                  <value>0x18</value>
                  <description>Interrupt Source: Transmit buffer empty; Interrupt Flag: UCTXIFG0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBCNTIFG</name>
                  <value>0x1A</value>
                  <description>Interrupt Source: Byte counter zero; Interrupt Flag: UCBCNTIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCCLTOIFG</name>
                  <value>0x1C</value>
                  <description>Interrupt Source: Clock low timeout; Interrupt Flag: UCCLTOIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBIT9IFG</name>
                  <value>0x1E</value>
                  <description>Interrupt Source: Nineth bit position; Interrupt Flag: UCBIT9IFG; Priority: Lowest</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB2IV_SPI</name>
          <addressOffset>0x2E</addressOffset>
          <size>16</size>
          <description>eUSCI_Bx Interrupt Vector Register</description>
          <fields>
            <field>
              <name>UCIV</name>
              <description>[15:0] eUSCI_B interrupt vector value</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIFG</name>
                  <value>0x2</value>
                  <description>Interrupt Source: Data received; Interrupt Flag: UCRXIFG; Interrupt Priority: Highest</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIFG</name>
                  <value>0x4</value>
                  <description>Interrupt Source: Transmit buffer empty; Interrupt Flag: UCTXIFG; Interrupt Priority: Lowest</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
