ibuttonlink/msp430fr5962/msp430fr5962.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>_INTERRUPTS</name>
      <baseAddress>65424</baseAddress>
      <interrupt>
        <name>PORT8</name>
        <description>0xFFB6</description>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>PORT7</name>
        <description>0xFFB8</description>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>EUSCI_B3</name>
        <description>0xFFBA</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>EUSCI_B2</name>
        <description>0xFFBC</description>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>EUSCI_B1</name>
        <description>0xFFBE</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>EUSCI_A3</name>
        <description>0xFFC0</description>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>EUSCI_A2</name>
        <description>0xFFC2</description>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>PORT6</name>
        <description>0xFFC4</description>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>PORT5</name>
        <description>0xFFC6</description>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>TIMER4_A1</name>
        <description>0xFFC8</description>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>TIMER4_A0</name>
        <description>0xFFCA</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>AES256</name>
        <description>0xFFCC</description>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>RTC_C</name>
        <description>0xFFCE</description>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>PORT4</name>
        <description>0xFFD0</description>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>PORT3</name>
        <description>0xFFD2</description>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>TIMER3_A1</name>
        <description>0xFFD4</description>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>TIMER3_A0</name>
        <description>0xFFD6</description>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>PORT2</name>
        <description>0xFFD8</description>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>TIMER2_A1</name>
        <description>0xFFDA</description>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>TIMER2_A0</name>
        <description>0xFFDC</description>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>PORT1</name>
        <description>0xFFDE</description>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_A1</name>
        <description>0xFFE0</description>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_A0</name>
        <description>0xFFE2</description>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>DMA</name>
        <description>0xFFE4</description>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>EUSCI_A1</name>
        <description>0xFFE6</description>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_A1</name>
        <description>0xFFE8</description>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_A0</name>
        <description>0xFFEA</description>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>ADC12_B</name>
        <description>0xFFEC</description>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>EUSCI_B0</name>
        <description>0xFFEE</description>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>EUSCI_A0</name>
        <description>0xFFF0</description>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>WDT</name>
        <description>0xFFF2</description>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_B1</name>
        <description>0xFFF4</description>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_B0</name>
        <description>0xFFF6</description>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>COMP_E</name>
        <description>0xFFF8</description>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>UNMI</name>
        <description>0xFFFA</description>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>SYSNMI</name>
        <description>0xFFFC</description>
        <value>54</value>
      </interrupt>
    </peripheral>
  </peripherals>
</device>
